Config/Catalogs/ДополнительныеИсточникиДанныхДляТиповыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДополнительныеИсточникиДанныхДляТиповыхОпераций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ТиповыеОперации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаполненияДополнительныхИсточниковДанныхТО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФункции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КолонкиИсточника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеТипаКолонкиСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыФункции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеТипаПараметраСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/СпособыЗаполненияДополнительныхИсточниковДанныхТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыЗаполненияДополнительныхИсточниковДанныхТО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДанныеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Функция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ДополнительныеИсточникиДанныхДляТиповыхОпераций/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Владелец) Тогда
		ВызватьИсключение НСтр("ru = 'Для создания дополнительного источника данных откройте типовую операцию,
									|перейдите в список дополнительных источников данных и создайте новый источник'");
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ИдентификаторДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ИдентификаторДокумента");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		ВызватьИсключение НСтр("ru = 'В типовой операции не задан документ
									|Дополнительные источники данных создаются после указания документа в типовой операции'");
	КонецЕсли;
	Попытка
		МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента);
	Исключение
		Возврат;
	КонецПопытки;
	
	Элементы.ИмяТабличнойЧасти.СписокВыбора.Очистить();
	Для каждого ТекТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		Элементы.ИмяТабличнойЧасти.СписокВыбора.Добавить(ТекТЧ.Имя, ТекТЧ.Синоним);
	КонецЦикла; 
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьСписокРеквизитовТабличнойЧасти();
		ОбновитьДинамическиеКолонкиВТаблицеКолонокИсточника();
		УстановитьТекущуюСтраницу(ЭтаФорма, Объект);
	КонецЕсли;
	
	ТипДокумента = ТипЗнч(ИдентификаторДокумента.ЗначениеПустойСсылки);
	ОписанияФункций = БухгалтерскиеОперацииИсточникиДанных.ОписаниеФункцийМодуля(ТипДокумента);
	ВсеОписанияФункций = Новый Соответствие;
	ВсеОписанияЗависимостей = Новый Соответствие;
	
	Для каждого ОписаниеФункции Из ОписанияФункций Цикл
	
		Элементы.ИмяФункции.СписокВыбора.Добавить(ОписаниеФункции.Имя, ОписаниеФункции.Заголовок);
		ВсеОписанияФункций.Вставить(ОписаниеФункции.Имя, ОписаниеФункции.Описание);
		ВсеОписанияЗависимостей.Вставить(ОписаниеФункции.Имя, СокрЛП(ОписаниеФункции.ЗависитОтФункций));
	
	КонецЦикла;
	
	ВсеОписанияФункцийФормы = Новый ФиксированноеСоответствие(ВсеОписанияФункций);
	ВсеЗависимостиФункцийФормы = Новый ФиксированноеСоответствие(ВсеОписанияЗависимостей);
	УстановитьОписаниеТекущейФункции(ЭтаФорма, Объект);
	УстановитьЗависимостьТекущейФункции(ЭтаФорма, Объект);
	//УстановитьЗависимостьТекущейФункции(ЭтаФорма, Объект);
	
	ЗаполнитьСписокВыбораФормулыПараметра();
	ЗаполнитьСписокРеквизитовТабличнойЧасти();
	
	Справочники.ДополнительныеИсточникиДанныхДляТиповыхОпераций.ПроверитьПравильностьЗаполненияИмениФункции(Объект, Элементы.ИмяФункции);
		      
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИдентификаторДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ИдентификаторДокумента");
	ЗаполнитьСписокРеквизитовТабличнойЧасти();
	ОбновитьОтображениеВыбранныхКолонокДокумента(ЭтаФорма, Объект);
	ОбновитьДинамическиеКолонкиВТаблицеКолонокИсточника();
	УстановитьТекущуюСтраницу(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьДинамическиеКолонкиВТаблицеКолонокИсточника();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для каждого ТекСтрока Из Объект.КолонкиИсточника Цикл
		
		ТекущийОбъект.КолонкиИсточника.Найти(ТекСтрока.ИсходныйНомерСтроки, "НомерСтроки").ОписаниеТипаКолонкиСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ТекСтрока.ТипЗначения);
		
	КонецЦикла; 	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТабличнаяЧастьПриИзменении(Элемент)
	
	ЗаполнитьСписокРеквизитовТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗаполненияПриИзменении(Элемент)
	УстановитьТекущуюСтраницу(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ИмяФункцииПриИзменении(Элемент)
	ОбновитьПараметрыИКолонкиФункцииНаСервере(); 
	УстановитьОписаниеТекущейФункции(ЭтаФорма, Объект);
	УстановитьЗависимостьТекущейФункции(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.ИмяИсточника) И Не ПустаяСтрока(Объект.Наименование) Тогда
		Объект.ИмяИсточника = СтрЗаменить(ТРег(Объект.Наименование), " ", "");
		БухгалтерскиеОперацииКлиентСервер.УдалитьЗапрещенныеСимволыИзИмени(Объект.ИмяИсточника);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыФункции

&НаКлиенте
Процедура ПараметрыФункцииФормулаПараметраАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	Если СтрДлина(Текст) = 0 Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьДанныеВыбораВводаПоСтрокеФормулыПараметра(Текст, ДанныеВыбора, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыФункцииФормулаПараметраОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Если СтрДлина(Текст) = 0 Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьДанныеВыбораВводаПоСтрокеФормулыПараметра(Текст, ДанныеВыбора, СтандартнаяОбработка)

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКолонкиИсточника

&НаКлиенте
Процедура КолонкиИсточникаИмяКолонкиПриИзменении(Элемент)
	ТекущиеДанные = Элементы.КолонкиИсточника.ТекущиеДанные;
	Для Каждого ТекЭлемент Из ВсеКолонкиТабличнойЧасти Цикл
		Если ТекущиеДанные.ИмяКолонки = ТекЭлемент.ИмяКолонки Тогда
			ТекущиеДанные.ТипЗначения = ТекЭлемент.ТипЗначения;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	ТекущиеДанные.ТипЗначения = Неопределено;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьКолонкиИзФункции(Команда)
	ОбновитьКолонкиИзФункцииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыИзФункции(Команда)
	ОбновитьПараметрыИзФункцииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПараметрыИзФункцииНаСервере()

	СохраненныеФормулыПараметров = Новый Соответствие;
	Для каждого ПараметрФункции Из Объект.ПараметрыФункции Цикл
	
		Если ЗначениеЗаполнено(ПараметрФункции.ФормулаПараметра) Тогда
			СохраненныеФормулыПараметров.Вставить(ВРЕГ(ПараметрФункции.ИмяПараметра), ПараметрФункции.ФормулаПараметра);
		КонецЕсли;
	
	КонецЦикла; 
	
	ОписанияФункций = БухгалтерскиеОперацииИсточникиДанных.ОписаниеФункцийМодуля();
	Для каждого ТекФункция Из ОписанияФункций Цикл
		
		Если ТекФункция.Имя <> Объект.ИмяФункции Тогда
			Продолжить;
		КонецЕсли;
		
		Объект.ПараметрыФункции.Очистить();
		Для каждого ТекПоле Из ТекФункция.Параметры Цикл
		
			НоваяСтрока = Объект.ПараметрыФункции.Добавить();
			НоваяСтрока.ИмяПараметра = ТекПоле.Имя;	
			НоваяСтрока.ОписаниеТипаПараметраСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ТекПоле.Тип);
			НоваяСтрока.ТипЗначения = ТекПоле.Тип;
			
			СохраненнаяФормула = СохраненныеФормулыПараметров.Получить(ВРЕГ(НоваяСтрока.ИмяПараметра));
			Если СохраненнаяФормула <> Неопределено Тогда
				НоваяСтрока.ФормулаПараметра = СохраненнаяФормула;
			КонецЕсли;
		
		КонецЦикла; 
		
		Прервать;
		
	КонецЦикла; 

КонецПроцедуры // ОбновитьПараметрыИзФункции()

&НаСервере
Процедура ОбновитьКолонкиИзФункцииНаСервере()

	ОписанияФункций = БухгалтерскиеОперацииИсточникиДанных.ОписаниеФункцийМодуля();
	Для каждого ТекФункция Из ОписанияФункций Цикл
	
		Если ТекФункция.Имя = Объект.ИмяФункции Тогда
			
			Объект.КолонкиИсточника.Очистить();
			Для каждого ТекПоле Из ТекФункция.Поля Цикл
			
				НоваяСтрока = Объект.КолонкиИсточника.Добавить();
				НоваяСтрока.ИмяКолонки = ТекПоле.Имя;
				НоваяСтрока.ОписаниеТипаКолонкиСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ТекПоле.Тип);
				НоваяСтрока.ТипЗначения = ТекПоле.Тип;
			
			КонецЦикла; 
			
			Прервать;
			
		КонецЕсли;
	
	КонецЦикла; 

КонецПроцедуры // ОбновитьКолонкиИзФункции()

&НаСервере
Процедура ЗаполнитьСписокРеквизитовТабличнойЧасти()
	
	Если Объект.СпособЗаполнения <> Перечисления.СпособыЗаполненияДополнительныхИсточниковДанныхТО.ДанныеДокумента Тогда
		Возврат;
	КонецЕсли;

	Список = Элементы.КолонкиИсточникаИмяКолонки.СписокВыбора;
	Список.Очистить();
	
	ВсеКолонкиТабличнойЧасти.Очистить();
	
	Если Не ЗначениеЗаполнено(Объект.ИмяТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеТЧ = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента).ТабличныеЧасти.Найти(Объект.ИмяТабличнойЧасти);
	Если МетаданныеТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого РеквизитТЧ Из МетаданныеТЧ.Реквизиты Цикл
	
		НоваяСтрока = ВсеКолонкиТабличнойЧасти.Добавить();
		НоваяСтрока.ИмяКолонки = РеквизитТЧ.Имя;
		НоваяСтрока.ТипЗначения = РеквизитТЧ.Тип;
		НоваяСтрока.ОписаниеТипаКолонкиСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(РеквизитТЧ.Тип);
	
		Список.Добавить(РеквизитТЧ.Имя, РеквизитТЧ.Синоним);
	
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСписокВыбораРеквизитов()

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОтображениеВыбранныхКолонокДокумента(Форма, Объект)

	ВыбранныеСтроки = Новый Массив;
	Для каждого ТекКолонка Из Объект.КолонкиИсточника Цикл
		
		Если ТекКолонка.Ресурс <> Истина Тогда
			СтрокаВСписке = Форма.ВыбранныеКолонки.НайтиПоЗначению(ТекКолонка.ИмяКолонки);
			Если СтрокаВСписке = Неопределено Тогда
				СтрокаВСписке = Форма.ВыбранныеКолонки.Добавить(ТекКолонка.ИмяКолонки);
			КонецЕсли;
			ВыбранныеСтроки.Добавить(СтрокаВСписке);
		КонецЕсли;
	
	КонецЦикла;
	УдалитьНеиспользуемыеСтрокиИзСписка(Форма.ВыбранныеКолонки, ВыбранныеСтроки);

	ВыбранныеСтроки = Новый Массив;
	Для каждого ТекКолонка Из Объект.КолонкиИсточника Цикл
		
		Если ТекКолонка.Ресурс = Истина Тогда
			СтрокаВСписке = Форма.ВыбранныеКолонкиРесурсы.НайтиПоЗначению(ТекКолонка.ИмяКолонки);
			Если СтрокаВСписке = Неопределено Тогда
				СтрокаВСписке = Форма.ВыбранныеКолонкиРесурсы.Добавить(ТекКолонка.ИмяКолонки);
			КонецЕсли;
			ВыбранныеСтроки.Добавить(СтрокаВСписке);
		КонецЕсли;
	
	КонецЦикла;
	УдалитьНеиспользуемыеСтрокиИзСписка(Форма.ВыбранныеКолонкиРесурсы, ВыбранныеСтроки);

КонецПроцедуры // ОбновитьОтображениеВыбранныхКолонокДокумента()

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьНеиспользуемыеСтрокиИзСписка(Список, ИспользуемыеСтроки)

	СтрокиКУдалению = Новый Массив;
	Для каждого ТекСтрока Из Список Цикл
	
		Если ИспользуемыеСтроки.Найти(ТекСтрока) = Неопределено Тогда
			СтрокиКУдалению.Добавить(ТекСтрока);	
		КонецЕсли;
	
	КонецЦикла; 
	
	Для каждого ТекСтрока Из СтрокиКУдалению Цикл
	
		Список.Удалить(ТекСтрока);
	
	КонецЦикла; 

КонецПроцедуры // УдалитьНеиспользуемыеСтрокиИзСписка()

&НаСервере
Процедура ОбновитьДинамическиеКолонкиВТаблицеКолонокИсточника()

	Для каждого ТекСтрока Из Объект.КолонкиИсточника Цикл
	
		Если ПустаяСтрока(ТекСтрока.ОписаниеТипаКолонкиСтрокой) Тогда
			ТекСтрока.ТипЗначения = Неопределено;
		Иначе
			Попытка
				ТекСтрока.ТипЗначения = ОбщегоНазначения.ЗначениеИзСтрокиXML(
					ТекСтрока.ОписаниеТипаКолонкиСтрокой);
			Исключение
				ТекСтрока.ТипЗначения = Неопределено;
			КонецПопытки
		КонецЕсли;
	
	КонецЦикла;

	Для каждого ТекСтрока Из Объект.ПараметрыФункции Цикл
	
		Если ПустаяСтрока(ТекСтрока.ОписаниеТипаПараметраСтрокой) Тогда
			ТекСтрока.ТипЗначения = Неопределено;
		Иначе
			Попытка
				ТекСтрока.ТипЗначения = ОбщегоНазначения.ЗначениеИзСтрокиXML(
					ТекСтрока.ОписаниеТипаПараметраСтрокой);
			Исключение
				ТекСтрока.ТипЗначения = Неопределено;
			КонецПопытки
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры // ОбновитьДинамическиеКолонкиВТаблицеКолонокИсточника()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекущуюСтраницу(Форма, Объект)

	Если Объект.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.СпособыЗаполненияДополнительныхИсточниковДанныхТО.ДанныеДокумента") Тогда
		Форма.Элементы.СтраницыКолонкиИсточникаДанных.ТекущаяСтраница = Форма.Элементы.СтраницаКолонкиИсточникаДанныхИзДокумента;
	Иначе
		Форма.Элементы.СтраницыКолонкиИсточникаДанных.ТекущаяСтраница = Форма.Элементы.СтраницаКолонкиИсточникаДанныхИзФункции;
	КонецЕсли;

КонецПроцедуры // УстановитьТекущуюСтраницу()

&НаСервере
Процедура ЗаполнитьСписокВыбораФормулыПараметра()

	Список = Элементы.ПараметрыФункцииФормулаПараметра.СписокВыбора;
	Список.Очистить();
	ОбъектМетаданных = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента);
	Для каждого РеквизитОбъекта Из ОбъектМетаданных.Реквизиты Цикл
	
		Список.Добавить("Документ." + РеквизитОбъекта.Имя,
			"Документ. " + РеквизитОбъекта.Синоним);
	
	КонецЦикла;
	Список.СортироватьПоПредставлению();
	
	СписокДопРеквизитов = Новый СписокЗначений;
	ДопРеквизитыТиповойОперации = Справочники.ТиповыеОперации.ДополнительныеРеквизитыТиповойОперации(Объект.Владелец, Истина, "Наименование");
	
	Для каждого ТекДопРеквизит Из ДопРеквизитыТиповойОперации Цикл
	
		СписокДопРеквизитов.Добавить("ДополнительныйРеквизит." + ТекДопРеквизит.ИмяДляФормулы,
			"Дополнительный реквизит. " + ТекДопРеквизит.Наименование);
	
	КонецЦикла; 
	СписокДопРеквизитов.СортироватьПоПредставлению();
	
	Для каждого ЭлементСписка Из СписокДопРеквизитов Цикл
	
		Список.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьСписокВыбораФормулыПараметра()

&НаКлиенте
Процедура ЗаполнитьДанныеВыбораВводаПоСтрокеФормулыПараметра(Текст, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	Список = Элементы.ПараметрыФункцииФормулаПараметра.СписокВыбора;
	Для каждого ЭлементСписка Из Список Цикл
	
		Если Лев(ЭлементСписка.Значение, 9) = "Документ." Тогда
			Если ВРЕГ(Сред(ЭлементСписка.Представление, 11, СтрДлина(Текст))) = ВРЕГ(Текст)
				ИЛИ ВРЕГ(Сред(ЭлементСписка.Значение, 10, СтрДлина(Текст))) = ВРЕГ(Текст) Тогда
				ДанныеВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			КонецЕсли;
		ИначеЕсли Лев(ЭлементСписка.Значение, 23) = "ДополнительныйРеквизит." Тогда
			Если ВРЕГ(Сред(ЭлементСписка.Представление, 26, СтрДлина(Текст))) = ВРЕГ(Текст)
				ИЛИ ВРЕГ(Сред(ЭлементСписка.Значение, 24, СтрДлина(Текст))) = ВРЕГ(Текст) Тогда
				ДанныеВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьДанныеВыбораВводаПоСтрокеФормулыПараметра()

&НаСервере
Процедура ОбновитьПараметрыИКолонкиФункцииНаСервере()

	ОбновитьПараметрыИзФункцииНаСервере();	
	ОбновитьКолонкиИзФункцииНаСервере();

КонецПроцедуры // ОбновитьПараметрыИКолонкиФункцииНаСервере()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОписаниеТекущейФункции(Форма, Объект)

	Если Форма.ВсеОписанияФункцийФормы.Получить(Объект.ИмяФункции) = Неопределено Тогда
		Форма.ОписаниеТекущейФункции = "";
	Иначе
		Форма.ОписаниеТекущейФункции = Форма.ВсеОписанияФункцийФормы.Получить(Объект.ИмяФункции);
	КонецЕсли;

КонецПроцедуры // УстановитьОписаниеТекущейФункции()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗависимостьТекущейФункции(Форма, Объект)

	Если Форма.ВсеЗависимостиФункцийФормы.Получить(Объект.ИмяФункции) = Неопределено Тогда
		Форма.ЗависимостьТекущейФункции = "";
	Иначе
		Форма.ЗависимостьТекущейФункции = Форма.ВсеЗависимостиФункцийФормы.Получить(Объект.ИмяФункции);
	КонецЕсли;

КонецПроцедуры // УстановитьЗависимостьТекущейФункции()

#КонецОбласти
